---
kind: method
id: M:Autodesk.Revit.UI.Macros.ApplicationEntryPoint.CreateRibbonTab(System.String)
source: html/89b8e17b-bf07-6ed4-e237-862fdd035386.htm
---
# Autodesk.Revit.UI.Macros.ApplicationEntryPoint.CreateRibbonTab Method

## Syntax (C#)
```csharp
public override void CreateRibbonTab(
	string tabName
)
```

## Parameters
- **tabName** (`System.String`)